import type { CompleteTranslations } from '../types';
export const translations: CompleteTranslations = {
	common: {
		acceptAll: 'Приеми всички',
		rejectAll: 'Отхвърли всички',
		customize: 'Персонализирай',
		save: 'Запази настройките',
	},
	cookieBanner: {
		title: 'Ценим вашата поверителност',
		description:
			'Този сайт използва бисквитки, за да подобри вашето потребителско изживяване, да анализира трафика на сайта и да показва персонализирано съдържание.',
	},
	consentManagerDialog: {
		title: 'Настройки за поверителност',
		description:
			'Персонализирайте вашите настройки за поверителност тук. Можете да изберете кои видове бисквитки и технологии за проследяване разрешавате.',
	},
	consentTypes: {
		necessary: {
			title: 'Строго необходими',
			description:
				'Тези бисквитки са от съществено значение за правилното функциониране на уебсайта и не могат да бъдат деактивирани.',
		},
		functionality: {
			title: 'Функционалност',
			description:
				'Тези бисквитки позволяват подобрена функционалност и персонализиране на уебсайта.',
		},
		marketing: {
			title: 'Маркетинг',
			description:
				'Тези бисквитки се използват за показване на подходящи реклами и проследяване на тяхната ефективност.',
		},
		measurement: {
			title: 'Аналитика',
			description:
				'Тези бисквитки ни помагат да разберем как посетителите взаимодействат с уебсайта и да подобрим неговата производителност.',
		},
		experience: {
			title: 'Потребителско изживяване',
			description:
				'Тези бисквитки ни помагат да осигурим по-добро потребителско изживяване и да тестваме нови функции.',
		},
	},
	frame: {
		title: 'Приемете съгласие за {category}, за да видите това съдържание.',
		actionButton: 'Активирайте съгласие за {category}',
	},
};
export default translations;
